romain-viollette/SunStripLed/eagle/library/boards.txt
# See: http://code.google.com/p/arduino/wiki/Platforms

##############################################################

uno.name=Arduino Uno (16MHZ)
uno.upload.protocol=arduino
uno.upload.maximum_size=32256
uno.upload.speed=115200
uno.bootloader.low_fuses=0xff
uno.bootloader.high_fuses=0xde
uno.bootloader.extended_fuses=0x05
uno.bootloader.path=optiboot
uno.bootloader.file=optiboot_atmega328.hex
uno.bootloader.unlock_bits=0x3F
uno.bootloader.lock_bits=0x0F
uno.build.mcu=atmega328p
uno.build.f_cpu=16000000L
uno.build.core=arduino
uno.build.variant=standard

##############################################################

uno20.name=Arduino Uno (20MHZ)
uno20.upload.protocol=arduino
uno20.upload.maximum_size=32256
uno20.upload.speed=115200
uno20.bootloader.low_fuses=0xff
uno20.bootloader.high_fuses=0xde
uno20.bootloader.extended_fuses=0x05
uno20.bootloader.path=optiboot
uno20.bootloader.file=optiboot_atmega328.hex
uno20.bootloader.unlock_bits=0x3F
uno20.bootloader.lock_bits=0x0F
uno20.build.mcu=atmega328p
uno20.build.f_cpu=20000000L
uno20.build.core=arduino
uno20.build.variant=standard

##############################################################

Gen7-644-16.name=Gen7 with ATmega644 and 16 MHz
Gen7-644-16.upload.protocol=stk500v2
Gen7-644-16.upload.maximum_size=63488
Gen7-644-16.upload.speed=115200
Gen7-644-16.bootloader.low_fuses=0xF7
Gen7-644-16.bootloader.high_fuses=0xDC
Gen7-644-16.bootloader.extended_fuses=0xFC
Gen7-644-16.bootloader.path=Gen7
Gen7-644-16.bootloader.file=bootloader-644-16MHz.hex
Gen7-644-16.bootloader.unlock_bits=0x3F
Gen7-644-16.bootloader.lock_bits=0x0F
Gen7-644-16.build.mcu=atmega644
Gen7-644-16.build.f_cpu=16000000L
Gen7-644-16.build.core=arduino
Gen7-644-16.build.variant=gen7

##############################################################

Gen7-644-20.name=Gen7 with ATmega644 and 20 MHz
Gen7-644-20.upload.protocol=stk500v2
Gen7-644-20.upload.maximum_size=63488
Gen7-644-20.upload.speed=115200
Gen7-644-20.bootloader.low_fuses=0xF7
Gen7-644-20.bootloader.high_fuses=0xDC
Gen7-644-20.bootloader.extended_fuses=0xFC
Gen7-644-20.bootloader.path=Gen7
Gen7-644-20.bootloader.file=bootloader-644-20MHz.hex
Gen7-644-20.bootloader.unlock_bits=0x3F
Gen7-644-20.bootloader.lock_bits=0x0F
Gen7-644-20.build.mcu=atmega644
Gen7-644-20.build.f_cpu=20000000L
Gen7-644-20.build.core=arduino
Gen7-644-20.build.variant=gen7

##############################################################

Gen7-644P-16.name=Gen7 with ATmega644P and 16 MHz
Gen7-644P-16.upload.protocol=stk500v2
Gen7-644P-16.upload.maximum_size=63488
Gen7-644P-16.upload.speed=115200
Gen7-644P-16.bootloader.low_fuses=0xF7
Gen7-644P-16.bootloader.high_fuses=0xDC
Gen7-644P-16.bootloader.extended_fuses=0xFC
Gen7-644P-16.bootloader.path=Gen7
Gen7-644P-16.bootloader.file=bootloader-644P-16MHz.hex
Gen7-644P-16.bootloader.unlock_bits=0x3F
Gen7-644P-16.bootloader.lock_bits=0x0F
Gen7-644P-16.build.mcu=atmega644p
Gen7-644P-16.build.f_cpu=16000000L
Gen7-644P-16.build.core=arduino
Gen7-644P-16.build.variant=gen7

##############################################################

Gen7-644P-20.name=Gen7 with ATmega644P and 20 MHz
Gen7-644P-20.upload.protocol=stk500v2
Gen7-644P-20.upload.maximum_size=63488
Gen7-644P-20.upload.speed=115200
Gen7-644P-20.bootloader.low_fuses=0xF7
Gen7-644P-20.bootloader.high_fuses=0xDC
Gen7-644P-20.bootloader.extended_fuses=0xFC
Gen7-644P-20.bootloader.path=Gen7
Gen7-644P-20.bootloader.file=bootloader-644P-20MHz.hex
Gen7-644P-20.bootloader.unlock_bits=0x3F
Gen7-644P-20.bootloader.lock_bits=0x0F
Gen7-644P-20.build.mcu=atmega644p
Gen7-644P-20.build.f_cpu=20000000L
Gen7-644P-20.build.core=arduino
Gen7-644P-20.build.variant=gen7

##############################################################

Gen7-1284P-16.name=Gen7 with ATmega1284P and 16 MHz
Gen7-1284P-16.upload.protocol=stk500v2
Gen7-1284P-16.upload.maximum_size=129024
Gen7-1284P-16.upload.speed=115200
Gen7-1284P-16.bootloader.low_fuses=0xF7
Gen7-1284P-16.bootloader.high_fuses=0xDC
Gen7-1284P-16.bootloader.extended_fuses=0xFC
Gen7-1284P-16.bootloader.path=Gen7
Gen7-1284P-16.bootloader.file=bootloader-1284P-16MHz.hex
Gen7-1284P-16.bootloader.unlock_bits=0x3F
Gen7-1284P-16.bootloader.lock_bits=0x0F
Gen7-1284P-16.build.mcu=atmega1284p
Gen7-1284P-16.build.f_cpu=16000000L
Gen7-1284P-16.build.core=arduino
Gen7-1284P-16.build.variant=gen7

##############################################################

Gen7-1284P-20.name=Gen7 with ATmega1284P and 20 MHz
Gen7-1284P-20.upload.protocol=stk500v2
Gen7-1284P-20.upload.maximum_size=129024
Gen7-1284P-20.upload.speed=115200
Gen7-1284P-20.bootloader.low_fuses=0xF7
Gen7-1284P-20.bootloader.high_fuses=0xDC
Gen7-1284P-20.bootloader.extended_fuses=0xFC
Gen7-1284P-20.bootloader.path=Gen7
Gen7-1284P-20.bootloader.file=bootloader-1284P-20MHz.hex
Gen7-1284P-20.bootloader.unlock_bits=0x3F
Gen7-1284P-20.bootloader.lock_bits=0x0F
Gen7-1284P-20.build.mcu=atmega1284p
Gen7-1284P-20.build.f_cpu=20000000L
Gen7-1284P-20.build.core=arduino
Gen7-1284P-20.build.variant=gen7

##############################################################

Gen7-1284-16.name=Gen7 with ATmega1284 and 16 MHz
Gen7-1284-16.upload.protocol=stk500v2
Gen7-1284-16.upload.maximum_size=129024
Gen7-1284-16.upload.speed=115200
Gen7-1284-16.bootloader.low_fuses=0xF7
Gen7-1284-16.bootloader.high_fuses=0xDC
Gen7-1284-16.bootloader.extended_fuses=0xFC
Gen7-1284-16.bootloader.path=Gen7
Gen7-1284-16.bootloader.file=bootloader-1284P-16MHz.hex
Gen7-1284-16.bootloader.unlock_bits=0x3F
Gen7-1284-16.bootloader.lock_bits=0x0F
Gen7-1284-16.build.mcu=atmega1284
Gen7-1284-16.build.f_cpu=16000000L
Gen7-1284-16.build.core=arduino
Gen7-1284-16.build.variant=gen7

##############################################################

Gen7-1284-20.name=Gen7 with ATmega1284 and 20 MHz
Gen7-1284-20.upload.protocol=stk500v2
Gen7-1284-20.upload.maximum_size=129024
Gen7-1284-20.upload.speed=115200
Gen7-1284-20.bootloader.low_fuses=0xF7
Gen7-1284-20.bootloader.high_fuses=0xDC
Gen7-1284-20.bootloader.extended_fuses=0xFC
Gen7-1284-20.bootloader.path=Gen7
Gen7-1284-20.bootloader.file=bootloader-1284P-20MHz.hex
Gen7-1284-20.bootloader.unlock_bits=0x3F
Gen7-1284-20.bootloader.lock_bits=0x0F
Gen7-1284-20.build.mcu=atmega1284
Gen7-1284-20.build.f_cpu=20000000L
Gen7-1284-20.build.core=arduino
Gen7-1284-20.build.variant=gen7

